
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавляемыеРеквизиты = Новый Массив;
	НовыйРеквизит = Новый РеквизитФормы("бит_Подсказка",Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(150))); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	НоваяГруппа = ЭтаФорма.Элементы.Добавить("бит_ГруппаПодсказки", Тип("ГруппаФормы"), Элементы.НациональныйАдрес);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_ПолучитьАдресаДействие");
	НоваяКоманда.Заголовок = "Общая команда";
	НоваяКоманда.Действие = "бит_ПолучитьАдреса";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_Подсказка", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_Подсказка";
	НовыйЭлемент.Заголовок = "Простой ввод";
	НовыйЭлемент.РежимВыбораИзСписка = Истина;
	НовыйЭлемент.УстановитьДействие("ИзменениеТекстаРедактирования", "бит_ПодсказкаПриИзменении");
	НовыйЭлемент.УстановитьДействие("ОбработкаВыбора", "бит_ПодсказкаОбработкаВыбора");
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ПолучитьАдресаКнопка", Тип("КнопкаФормы"), НоваяГруппа);
	НовыйЭлемент.Заголовок = "Подсказать";
	НовыйЭлемент.ИмяКоманды = "бит_ПолучитьАдресаДействие";
КонецПроцедуры

&НаКлиенте
Процедура бит_ПодсказкаПриИзменении(Элемент)
	Подсказки = бит_ИнтеграцияDadataКлиент.ПолучитьПодсказкиДляВыбора(Элемент.ТекстРедактирования);
	Элементы.бит_Подсказка.СписокВыбора.Очистить();
	Для Каждого Подск Из Подсказки Цикл
		Элементы["бит_Подсказка"].СписокВыбора.Добавить(бит_ИнтеграцияDadataКлиент.ПреобразоватьВСтрокуJSON(Подск), Подск.value);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура бит_ПодсказкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НаселенныйПунктДетально = бит_ИнтеграцияDadataКлиент.ПрочитатьСтрокуJSON(ВыбранноеЗначение);
	ОбработкаИзмененияАдреса();
КонецПроцедуры

&НаКлиенте
Процедура бит_ПолучитьАдреса(Команда)
	//бит_ИнтеграцияDadataКлиент.ПолучитьПодсказки(бит_Подсказка);
	Подсказки = бит_ИнтеграцияDadataКлиент.ПолучитьПодсказкиДляВыбора(ЭтаФорма["бит_Подсказка"]);
	Элементы.бит_Подсказка.СписокВыбора.Очистить();
	Для Каждого Подск Из Подсказки Цикл
		Элементы["бит_Подсказка"].СписокВыбора.Добавить(бит_ИнтеграцияDadataКлиент.ПреобразоватьВСтрокуJSON(Подск), Подск.value);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура бит_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "бит_ВыборПодсказкиАдреса" Тогда
		НаселенныйПунктДетально = бит_ИнтеграцияDadataКлиент.ПрочитатьСтрокуJSON(Параметр);
		ОбработкаИзмененияАдреса();
	КонецЕсли;
КонецПроцедуры

