
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастройкиИнтеграции = бит_ИнтеграцияDadata.ПолучитьНастройки(); 
	//Если ЗначениеЗаполнено(НастройкиИнтеграции.УчаствующиеПользователи) Тогда
	//	Для Каждого Пользователь Из НастройкиИнтеграции.УчаствующиеПользователи Цикл
	//		НоваяСтрока = УчаствующиеПользователи.Добавить();
	//		НоваяСтрока.Пользователь = Пользователь;
	//	КонецЦикла;
	//КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Прочитать();
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//_Пользователи = Новый Массив;
	//Для Каждого СтрТЗ Из УчаствующиеПользователи Цикл
	//	_Пользователи.Добавить(СтрТЗ.Пользователь);
	//КонецЦикла;
	//ТекущийОбъект.УчаствующиеПользователи = Новый ХранилищеЗначения(_Пользователи);
КонецПроцедуры

