Функция ПреобразоватьВСтрокуJSON(Объект) Экспорт
	JSONЗапись = Новый ЗаписьJSON;
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(, Символы.Таб, Истина);
	JSONЗапись.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(JSONЗапись, Объект);
	Возврат JSONЗапись.Закрыть();
КонецФункции

Функция ПрочитатьСтрокуJSON(Стр) Экспорт
	JSONЧтение = Новый ЧтениеJSON;
	JSONЧтение.УстановитьСтроку(Стр);
	Возврат ПрочитатьJSON(JSONЧтение, Ложь);
КонецФункции

Функция СделатьПервуюЗаглавной(Стр)
	Возврат ВРег(Лев(Стр,1))+Сред(Стр,2);
КонецФункции

Функция ПреобразоватьВСтруктуруАдреса1с(Эл)
	Рез = Новый Структура();
	Рез.Вставить("value", Эл.unrestricted_value);
	Рез.Вставить("comment", "");
	_Данные = Эл.data;
	Рез.Вставить("id", _Данные.fias_id);
	Рез.Вставить("type", "Адрес");
	Рез.Вставить("country", ВРег(_Данные.Country));
	Рез.Вставить("addressType", "Административно-территориальный");
	Рез.Вставить("countryCode", "");
	Рез.Вставить("ZIPcode", _Данные.postal_code);
	
	Рез.Вставить("city", _Данные.city);
	Рез.Вставить("cityType", _Данные.city_type);
	Рез.Вставить("cityId", _Данные.city_fias_id); 
	
	Рез.Вставить("street", _Данные.street);
	Рез.Вставить("streetType", _Данные.street_type);
	Рез.Вставить("streetId", _Данные.street_fias_id); 
	
	Рез.Вставить("area", _Данные.region);
	Рез.Вставить("areaType", _Данные.region_type);
	Рез.Вставить("areaCode", _Данные.region_iso_code);
	Рез.Вставить("areaId", _Данные.region_fias_id);
	
	Рез.Вставить("district", _Данные.area);
	Рез.Вставить("districtType", _Данные.area_type);
	Рез.Вставить("districtId", _Данные.area_fias_id);
	
	Рез.Вставить("munDistrict", "");
	Рез.Вставить("munDistrictType", "");
	Рез.Вставить("munDistrictId", "");
	
	Рез.Вставить("settlement", _Данные.settlement);
	Рез.Вставить("settlementType", _Данные.settlement_type);
	Рез.Вставить("settlementId", _Данные.settlement_fias_id); 
	
	Рез.Вставить("cityDistrict", _Данные.city_district);
	Рез.Вставить("cityDistrictType", _Данные.city_district_type);
	Рез.Вставить("cityDistrictId", _Данные.city_district_fias_id);
	
	Рез.Вставить("territory", "");
	Рез.Вставить("territoryType", "");
	Рез.Вставить("territoryId", "");
	
	Рез.Вставить("locality", "");
	Рез.Вставить("localityType", "");
	Рез.Вставить("localityId", "");
	
	Рез.Вставить("houseType", СделатьПервуюЗаглавной(_Данные.house_type_full));
	Рез.Вставить("houseNumber", _Данные.house);
	Рез.Вставить("houseId", _Данные.house_fias_id);
	
	Рез.Вставить("buildings", Новый Массив);
	Если ЗначениеЗаполнено(_Данные.stead) И ЗначениеЗаполнено(_Данные.stead_type_full) Тогда
		Рез.buildings.Добавить(Новый Структура("type, number", СделатьПервуюЗаглавной(_Данные.stead_type_full), _Данные.stead));
	КонецЕсли;
	Если ЗначениеЗаполнено(_Данные.block) И ЗначениеЗаполнено(_Данные.block_type_full) Тогда
		Рез.buildings.Добавить(Новый Структура("type, number", СделатьПервуюЗаглавной(_Данные.block_type_full), _Данные.block));
	КонецЕсли; 
	
	Рез.Вставить("apartments", Новый Массив);
	Если ЗначениеЗаполнено(_Данные.flat) И ЗначениеЗаполнено(_Данные.flat_type_full) Тогда
		Рез.apartments.Добавить(Новый Структура("type, number", СделатьПервуюЗаглавной(_Данные.flat_type_full), _Данные.flat));
	КонецЕсли;
	
	Рез.Вставить("codeKLADR", _Данные.kladr_id);
	Рез.Вставить("oktmo", _Данные.oktmo);
	Рез.Вставить("okato", _Данные.okato);
	Рез.Вставить("asInDocument", "");
	Рез.Вставить("ifnsFLCode", _Данные.tax_office);
	Рез.Вставить("ifnsULCode", _Данные.tax_office_legal);
	Рез.Вставить("ifnsFLAreaCode", "");
	Рез.Вставить("ifnsULAreaCode", _Данные.tax_office_legal);
	Рез.Вставить("stead", _Данные.stead_type_full);
	Рез.Вставить("steadId", "");
	Рез.Вставить("КраткоеПредставление", Ложь);
	Для Каждого _Эл Из Рез Цикл
		Если _Эл.Значение = Неопределено Тогда
			Рез[_Эл.Ключ] = "";
		КонецЕсли;
	КонецЦикла;
	
	Возврат Рез;
КонецФункции


Функция ПолучитьПодсказки(Текст) Экспорт                        
	Подсказки = Новый Массив;
	Для Каждого Подск Из бит_ИнтеграцияDadata.ВыполнитьЗапрос(Текст).suggestions Цикл
		Подсказки.Добавить(ПреобразоватьВСтруктуруАдреса1с(Подск));
	КонецЦикла;
	ОткрытьФорму("ОбщаяФорма.бит_ФормаПодсказкиАдреса", Новый Структура("Подсказки", Подсказки),,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецФункции


Функция ПолучитьПодсказкиДляВыбора(Текст) Экспорт
	Подсказки = Новый Массив;
	Для Каждого Подск Из бит_ИнтеграцияDadata.ВыполнитьЗапрос(Текст).suggestions Цикл
		Подсказки.Добавить(ПреобразоватьВСтруктуруАдреса1с(Подск));
	КонецЦикла;
	Возврат Подсказки;
КонецФункции
