
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Подсказки") Тогда
		Для Каждого Подск Из Параметры.Подсказки Цикл
			Стр = ВариантыВыбора.Добавить();
			Стр.Представление = Подск.value;
			Стр.Структура = бит_ИнтеграцияDadata.ПреобразоватьВСтрокуJSON(Подск);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбор(Команда)
	Оповестить("бит_ВыборПодсказкиАдреса", Элементы.ВариантыВыбора.ТекущиеДанные.Структура);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
